Introduction
What is pandas?
Pandas is a fast, powerful, flexible and easy-to-use open source data analysis and manipulation tool built on top of the Python programming language.
It is also one of the most popular libraries used by data experts from all around the woras?

What can you do with pandas?
Pandas is used for data wrangling, data analysis and data visualisation.
Some examples include creating and merging dataframes, dropping unwanted columns and rows, locating and filling null values, grouping data by category, creating basic plots like barplot, scatter plot, histogram et.

Why should you learn to use pandas?
As humans interact more and more with technology, vast amounts of data are being generated each day. Hence, the ability to analyse these data and draw insights from them is becoming an increasingly important skill to have in the modern workforce. Organisations are progressively turning to data to help them better understand their customers and products, analyse past trends and patterns, improve operational efficiency and so on.
Here are just some of the many reasons why you should learn pandas:
•	By learning pandas, you learn the fundamental ideas behind working with data as well as some skill and knowledge to code in Python
•	It is straightforward to learn and you can immediately apply it to any dataset you want
•	It is commonly used in the data science and machine learning commnity

Where can you find pandas?
Best way to get access to pandas is by installing Anaconda which is a distribution of the Python and R programming languages, both of which are heavily used in data science.
By installing Anaconda, you will also have access to Jupyter notebook which is what I am using to write up this documentation. Jupyter notebook allows you to easily run your Python code cell by cell.

In [25]:
import pandas as pd

In [26]:
train=pd.read_csv('titanic_train.csv')

In [27]:
train.head()  # head function give starting 5 indexes by default

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [28]:
train.tail()  # tail function give last 5 indexes by default

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [29]:
train.shape   # shape function shows the numbers of columns and rows exist

(891, 12)

In [30]:
train.info()  # info funcgtion shows the full information about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [31]:
train.isnull().sum() # isnull sum function shows that how many null values exist in particular key

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

CREATING YOUR OWN DATAFRAME

In [44]:
# number entries
test_scores=pd.DataFrame({'student_id':[154,973,645],'Science':[50,75,31],'geography':[88,100,66],'math':[72,86,94]})
test_scores

   student_id  Science  geography  math
0         154       50         88    72
1         973       75        100    86
2         645       31         66    94

In [45]:
# text entries
survey=pd.DataFrame({'james':['I liked it','more salt'],'emily':['it is too sweet','yum']})
survey

        james            emily
0  I liked it  it is too sweet
1   more salt              yum

In [48]:
# index
test_scores=test_scores.set_index('student_id')
test_scores

            Science  geography  math
student_id
154              50         88    72
973              75        100    86
645              31         66    94

In [49]:
survey=pd.DataFrame({'james':[' i liked it','more salt'],'emily':['it is too sweet','yum']},index=['product a','product b'])
survey

                 james            emily
product a   i liked it  it is too sweet
product b    more salt              yum

In [50]:
# reset index
# try playing around with 'drop' and 'inplace' and see what they do
survey.reset_index(drop=True,inplace=True)
survey

         james            emily
0   i liked it  it is too sweet
1    more salt              yum

RENAMING COLUMNS --- suppose if we want to change the names of the first two columns

In [51]:
# suppose we want to change the names of the first two columns

In [52]:
test_scores.rename(columns={'geography':'physics','science':'arts'},inplace=True)
test_scores

            Science  physics  math
student_id
154              50       88    72
973              75      100    86
645              31       66    94

DROPPING COLUMNS AND ROWS

In [53]:
test_scores.drop(columns='math',inplace=True)
test_scores

            Science  physics
student_id
154              50       88
973              75      100
645              31       66

In [54]:
# drop row with student_id 973
# we can make this more robust once we learn the 'loc' function in the coming weeks
test_scores.drop(973,inplace=True)
test_scores

            Science  physics
student_id
154              50       88
645              31       66

adding new columns

In [55]:
test_scores['history']=[79,70]
test_scores

            Science  physics  history
student_id
154              50       88       79
645              31       66       70